CDCRenderTarget.m_pDCRenderTarget
A pointer to an ID2D1DCRenderTarget object.

CDCRenderTarget.op_Implicit~ID2D1DCRenderTarget*
Returns ID2D1DCRenderTarget interface
Returns:
Pointer to an ID2D1DCRenderTarget interface or NULL if object is not initialized yet.

CDCRenderTarget.GetDCRenderTarget
Returns ID2D1DCRenderTarget interface
Returns:
Pointer to an ID2D1DCRenderTarget interface or NULL if object is not initialized yet.

CDCRenderTarget.BindDC(CDC!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,CRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Binds the render target to the device context to which it issues drawing commands
Returns: If the method succeeds, it returns TRUE. Otherwise, it returns FALSE.
dc: The device context to which the render target issues drawing commands
rect: The dimensions of the handle to a device context (HDC) to which the render target is bound

CDCRenderTarget.Create(D2D1_RENDER_TARGET_PROPERTIES!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates a CDCRenderTarget.
Returns:
If the method succeeds, it returns TRUE. Otherwise, it returns FALSE.
props: The rendering mode, pixel format, remoting options, DPI information, and the minimum DirectX support required for hardware rendering.

CDCRenderTarget.Detach
Detaches render target interface from the object
Returns:
Pointer to detached render target interface.

CDCRenderTarget.Attach(ID2D1DCRenderTarget*)
Attaches existing render target interface to the object
pTarget: Existing render target interface. Cannot be NULL

CDCRenderTarget.#ctor
Constructs a CDCRenderTarget object.

CDCRenderTarget
ID2D1DCRenderTarget wrapper.